# Creating a Movies Database

![png](ERD-Movies.png)

## Import Libraries and Load Data Files

In [45]:
# Load libraries
import pandas as pd
import numpy as np
import os, time, json
import tmdbsimple as tmdb 
from tqdm.notebook import tqdm_notebook

# For passwords with symbols
from urllib.parse import quote_plus

from sqlalchemy import create_engine
pd.set_option('display.max_columns',50)

In [2]:
# Making new folder, "Data", with os
import os
os.makedirs('Data/',exist_ok=True)

In [3]:
# Confirm folder was created and files added successfully
os.listdir("Data/")

['preprocessed-title-basics.csv',
 'title.basics.tsv.gz',
 'title.ratings.tsv.gz',
 'title-akas-us-only.csv',
 '.ipynb_checkpoints',
 'preprocessed-title-ratings.csv']

In [4]:
# Load the akas file
akas = pd.read_csv('Data/title-akas-us-only.csv', low_memory=False)
akas

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
1,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,\N,imdbDisplay,\N,0
3,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
4,tt0000005,6,Blacksmith Scene #1,US,\N,alternative,\N,0
...,...,...,...,...,...,...,...,...
1452559,tt9916560,1,March of Dimes Presents: Once Upon a Dime,US,\N,imdbDisplay,\N,0
1452560,tt9916620,1,The Copeland Case,US,\N,imdbDisplay,\N,0
1452561,tt9916702,1,Loving London: The Playground,US,\N,\N,\N,0
1452562,tt9916756,1,Pretty Pretty Black Girl,US,\N,imdbDisplay,\N,0
1452563,tt9916764,1,38,US,\N,imdbDisplay,\N,0

In [5]:
# Load the title basics file
basics = pd.read_csv('Data/title.basics.tsv.gz', sep='\t', low_memory=False)
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
...,...,...,...,...,...,...,...,...,...
10017006,tt9916848,tvEpisode,Episode #3.17,Episode #3.17,0,2009,\N,\N,"Action,Drama,Family"
10017007,tt9916850,tvEpisode,Episode #3.19,Episode #3.19,0,2010,\N,\N,"Action,Drama,Family"
10017008,tt9916852,tvEpisode,Episode #3.20,Episode #3.20,0,2010,\N,\N,"Action,Drama,Family"
10017009,tt9916856,short,The Wind,The Wind,0,2015,\N,27,Short
10017010,tt9916880,tvEpisode,Horrid Henry Knows It All,Horrid Henry Knows It All,0,2014,\N,10,"Adventure,Animation,Comedy"

In [6]:
# Load the title ratings file
ratings = pd.read_csv('Data/title.ratings.tsv.gz', sep='\t', low_memory=False)
ratings

            tconst  averageRating  numVotes
0        tt0000001            5.7      1988
1        tt0000002            5.8       265
2        tt0000003            6.5      1849
3        tt0000004            5.5       178
4        tt0000005            6.2      2632
...            ...            ...       ...
1331487  tt9916730            8.3        10
1331488  tt9916766            7.0        21
1331489  tt9916778            7.2        36
1331490  tt9916840            7.5         7
1331491  tt9916880            7.0         7

[1331492 rows x 3 columns]

## Dataset Pre-processing

### Pre-processing the title basics frame

In [7]:
# Filter the basics table to only include the US movies using the filter akas dataframe
filter_us_titles = basics['tconst'].isin(akas['titleId'])
basics = basics[filter_us_titles]

In [8]:
# Convert placeholder "\N" values in the basics table back to true null values to identify missing genres and runtimes
basics = basics.replace("\\N", np.nan)

In [9]:
# Drop rows with null values in the runtimeMinutes or genres columns
basics = basics.dropna(subset = ['runtimeMinutes', 'genres'])

In [10]:
# Filter to keep only full-length movies
filter_flength = basics['titleType'] == 'movie'
basics = basics[filter_flength]

In [11]:
# Convert startYear to a float dtype
basics['startYear'] = basics['startYear'].astype(float)

In [12]:
# Filter to keep movies with startYear that are >=2000 and <=2022
filter_startYear = (basics['startYear'] >= 2000) & (basics['startYear'] <= 2022)
basics = basics[filter_startYear]

In [13]:
# Eliminate movies that include "Documentary" in genre
filter_documentaries = basics['genres'].str.contains('Documentary')
# Exclude movies in the documentary category.
basics = basics[~filter_documentaries]

In [14]:
# Display a final preview of the filtered title basics
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [15]:
# Display a final preview of the filtered title basics
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 86979 entries, 34802 to 10016777
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  object
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      object
 7   runtimeMinutes  86979 non-null  object
 8   genres          86979 non-null  object
dtypes: float64(1), object(8)
memory usage: 6.6+ MB

In [16]:
# Select only the necessary columns from basics dataframe and store them in title_basics dataframe
title_basics = basics.drop(columns = ['titleType', 'originalTitle', 'isAdult', 'endYear', 'genres'])

In [17]:
# Rename some columns of title_basics to make them consistent with the columns of the mySQL title_basics table
title_basics = title_basics.rename(columns = {'primaryTitle':'primary_title', 'startYear':'start_year', 'runtimeMinutes':'runtime'})

In [18]:
# Fix data type
title_basics['runtime'] = title_basics['runtime'].astype(int)

In [19]:
# Save the preprocessed title basics as a csv file
title_basics.to_csv('Data/preprocessed-title-basics.csv', index = False)

In [20]:
# Display a final preview of the filtered title_basics
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 86979 entries, 34802 to 10016777
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         86979 non-null  object
 1   primary_title  86979 non-null  object
 2   start_year     86979 non-null  float64
 3   runtime        86979 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.3+ MB

### Pre-processing the title ratings dataframe

In [21]:
# Load and filter the title ratings file to keep only movies that are included in your final title basics dataframe
filter_basics = ratings['tconst'].isin(basics['tconst'])

In [22]:
# Replace "\N" with np.nan
ratings = ratings.replace(r'\n', np.nan)

In [23]:
# Display a final preview of the filtered title ratings
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1988
1  tt0000002            5.8       265
2  tt0000003            6.5      1849
3  tt0000004            5.5       178
4  tt0000005            6.2      2632

In [24]:
# Display a final preview of the filtered title ratings
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1331492 entries, 0 to 1331491
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1331492 non-null  object
 1   averageRating  1331492 non-null  float64
 2   numVotes       1331492 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 30.5+ MB

In [25]:
# Rename some columns of title_basics to make them consistent with the columns of the mySQL title_basics table
ratings = ratings.rename(columns = {'averageRating':'average_rating', 'numVotes': 'number_of_votes'})

In [26]:
# Display a final preview of the title ratings dataframe
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1331492 entries, 0 to 1331491
Data columns (total 3 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   tconst           1331492 non-null  object
 1   average_rating   1331492 non-null  float64
 2   number_of_votes  1331492 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 30.5+ MB

In [27]:
# Save the preprocessed title ratings as a csv file
ratings.to_csv('Data/preprocessed-title-ratings.csv', index = False)

## Establish Connections

In [28]:
# Create the sqlalchemy engine and connection
username = "root"
password = quote_plus("iloveJESUS@87")
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

## Insert data from dataframe to database tables

In [30]:
# Insert dataframes into respective tables

# title_basics
title_basics.to_sql('title_basics', con=engine, if_exists='replace', index=False)

86979

In [32]:
# Insert dataframes into respective tables

# ratings
ratings.to_sql('ratings', con=engine, if_exists='replace', index=False)

1331492

## Check the table entries (Test Queries)

In [33]:
# Show Tables
q = """
SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [34]:
# Check title_basics
q = """
SELECT *
FROM title_basics;"""
pd.read_sql(q, conn)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
86974,tt9914942,Life Without Sara Amat,2019.0,74
86975,tt9915872,The Last White Witch,2019.0,97
86976,tt9916170,The Rehearsal,2019.0,51
86977,tt9916190,Safeguard,2020.0,95
86978,tt9916362,Coven,2020.0,92

In [35]:
# Describe title_basics
q = """
DESCRIBE title_basics;"""
pd.read_sql(q, conn)

           Field    Type Null Key Default Extra
0         tconst    text  YES        None
1  primary_title    text  YES        None
2     start_year  double  YES        None
3        runtime  bigint  YES        None

In [36]:
# Check ratings
q = """
SELECT *
FROM ratings;"""
pd.read_sql(q, conn)

            tconst  average_rating  number_of_votes
0        tt0000001             5.7             1988
1        tt0000002             5.8              265
2        tt0000003             6.5             1849
3        tt0000004             5.5              178
4        tt0000005             6.2             2632
...            ...             ...              ...
1331487  tt9916730             8.3               10
1331488  tt9916766             7.0               21
1331489  tt9916778             7.2               36
1331490  tt9916840             7.5                7
1331491  tt9916880             7.0                7

[1331492 rows x 3 columns]

In [37]:
q = """
DESCRIBE ratings;"""
pd.read_sql(q, conn)

             Field    Type Null Key Default Extra
0           tconst    text  YES        None
1   average_rating  double  YES        None
2  number_of_votes  bigint  YES        None

## Insert more data into the database tables

### Define necessary functions

In [38]:
# Define a function that gets the movie with rating from TMDB database through its API
def get_movie_with_rating(movie_id):
    """ Adapted from source = https://github.com/celiao/tmdbsimple """
    # Get the movie object for the current id
    movie = tmdb.Movies(movie_id)
    # Save the .info and .releases dictionary
    info = movie.info()
    releases = movie.releases()
    # Loop through the countries in releases
    for c in releases['countries']:
        # if the country abbreviation == US
        if c['iso_3166_1'] == 'US':
            ## Save a certification key in info with the certification
            info['certification'] = c['certification']
    return info

In [70]:
# Define a function that creates a JSON file that stores the result for the API call
def create_json_file(JSON_FILE, year, delete_if_exists=False):
    
    ## Check if JSON_FILE exists
    file_exists = os.path.isfile(JSON_FILE)
    
    ## If it DOES exist:
    if file_exists == True:
        
        ## Check if user wants to delete if exists
        if delete_if_exists==True:
            
            print(f"[!] {JSON_FILE} already exists. Deleting previous file...")
            ## delete file and confirm it no longer exits.
            os.remove(JSON_FILE)
            ## Recursive call to function after old file deleted
            create_json_file(JSON_FILE, i, delete_if_exists=False)
        else:
            print(f"[i] {JSON_FILE} already exists.")            
            
            
    ## If it does NOT exist:
    else:
        
        ## INFORM USER AND SAVE EMPTY LIST
        print(f"Creating {JSON_FILE} for API results for {year}.")
        
        ## CREATE ANY NEEDED FOLDERS
        # Get the Folder Name only
        folder = os.path.dirname(JSON_FILE)
        
        ## If JSON_FILE included a folder:
        if len(folder)>0:
            # create the folder
            os.makedirs(folder,exist_ok=True)
        ## Save empty list to start the json file
        with open(JSON_FILE,'w') as f:
            json.dump([{'imdb_id':0}],f)

In [40]:
# Define function to write to json file
def write_json(new_data, filename): 
    """Appends a list of records (new_data) to a json file (filename). 
    Adapted from: https://www.geeksforgeeks.org/append-to-json-file-using-python/"""  
    
    with open(filename,'r+') as file:
        # First we load existing data into a dict.
        file_data = json.load(file)
        ## Choose extend or append
        if (type(new_data) == list) & (type(file_data) == list):
            file_data.extend(new_data)
        else:
             file_data.append(new_data)
        # Sets file's current position at offset.
        file.seek(0)
        # convert back to json.
        json.dump(file_data, file)

### Create a JSON file that stores the extracted data from TMDB through API calls

In [67]:
# Create the folder for saving files (if it doesn't exist)
FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)
# Create a list that contains the years in which the required movies by the stakeholders were saved
YEAR = [2001, 2002]
# Create an errors variable 
errors = [ ]
# Create movie_ids list
movie_ids = []
# Create movie_ids_to_get variable that saves the movie ids that are not yet saved in the existing (previous) JSON file
movie_ids_to_get = [ ]

In [72]:
# Start of OUTER loop
for i in tqdm_notebook(YEAR, desc='YEARS', position=0):
    
    #Saving new year as the current df
    df = title_basics.loc[ title_basics['start_year'] == i].copy()
    
    # saving movie ids to separate variable
    movie_ids = df['tconst']
    
    #Defining the JSON file to store results for year
    JSON_FILE = f'{FOLDER}tmdb_api_results_{i}.json'
    print(f'data will be saved to: {JSON_FILE}')
    
    # Create a JSON file
    create_json_file(JSON_FILE, i, delete_if_exists=True)

    # Load existing data from json into a dataframe called "previous_df"
    previous_df = pd.read_json(JSON_FILE)

    # Filter out any ids that are already in the JSON_FILE
    movie_ids_temp = movie_ids[~movie_ids.isin(previous_df['imdb_id'])]

    # Save movie ids to get from TMDB
    movie_ids_to_get.append(movie_ids_temp)

YEARS:   0%|          | 0/2 [00:00<?, ?it/s]

data will be saved to: Data/tmdb_api_results_2001.json
[!] Data/tmdb_api_results_2001.json already exists. Deleting previous file...
Creating Data/tmdb_api_results_2001.json for API results for 2001.
data will be saved to: Data/tmdb_api_results_2002.json
[!] Data/tmdb_api_results_2002.json already exists. Deleting previous file...
Creating Data/tmdb_api_results_2002.json for API results for 2002.

### A

In [ ]:
movie_ids_to_get